; domain
(define (domain mailfloor)
 (:requirements :strips :typing)
 (:types bay parcel carrier hand)
 (:predicates (stationed-at ?r - carrier ?x - bay)
         (posted ?o - parcel ?x - bay)
        (vacant ?r - carrier ?g - hand)
        (bearing ?r - carrier ?o - parcel ?g - hand))

   (:action walk
       :parameters  (?r - carrier ?from ?to - bay)
       :precondition (and  (stationed-at ?r ?from))
       :effect (and  (stationed-at ?r ?to)
         (not (stationed-at ?r ?from))))

   (:action collect
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (posted ?obj ?room) (stationed-at ?r ?room) (vacant ?r ?g))
       :effect (and (bearing ?r ?obj ?g)
        (not (posted ?obj ?room))
        (not (vacant ?r ?g))))

   (:action deposit
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (bearing ?r ?obj ?g) (stationed-at ?r ?room))
       :effect (and (posted ?obj ?room)
        (vacant ?r ?g)
        (not (bearing ?r ?obj ?g)))))

; problem
(define (problem mailfloor-p05)
(:domain mailfloor)
(:objects carrier1 carrier2 carrier3 - carrier
righthand1 lefthand1 righthand2 lefthand2 righthand3 lefthand3 - hand
bay1 bay2 bay3 bay4 bay5 - bay
parcel1 parcel2 parcel3 parcel4 parcel5 - parcel)
(:init
(stationed-at carrier1 bay5)
(vacant carrier1 righthand1)
(vacant carrier1 lefthand1)
(stationed-at carrier2 bay1)
(vacant carrier2 righthand2)
(vacant carrier2 lefthand2)
(stationed-at carrier3 bay1)
(vacant carrier3 righthand3)
(vacant carrier3 lefthand3)
(posted parcel1 bay2)
(posted parcel2 bay4)
(posted parcel3 bay1)
(posted parcel4 bay1)
(posted parcel5 bay5)
)
(:goal
(and
(posted parcel1 bay2)
(posted parcel2 bay2)
(posted parcel3 bay3)
(posted parcel4 bay2)
(posted parcel5 bay1)
)
)
)

; plan
1. (walk carrier3 bay1 bay2)
   deleted: (stationed-at carrier3 bay1)
   added: (stationed-at carrier3 bay2)
   goals met: 1 of 5
2. (collect carrier2 parcel3 bay1 righthand2)
   deleted: (posted parcel3 bay1) (vacant carrier2 righthand2)
   added: (bearing carrier2 parcel3 righthand2)
   goals met: 1 of 5
3. (walk carrier2 bay1 bay3)
   deleted: (stationed-at carrier2 bay1)
   added: (stationed-at carrier2 bay3)
   goals met: 1 of 5
4. (deposit carrier2 parcel3 bay3 righthand2)
   deleted: (bearing carrier2 parcel3 righthand2)
   added: (posted parcel3 bay3) (vacant carrier2 righthand2)
   goals met: 2 of 5
5. (collect carrier1 parcel5 bay5 righthand1)
   deleted: (posted parcel5 bay5) (vacant carrier1 righthand1)
   added: (bearing carrier1 parcel5 righthand1)
   goals met: 2 of 5
6. (walk carrier1 bay5 bay1)
   deleted: (stationed-at carrier1 bay5)
   added: (stationed-at carrier1 bay1)
   goals met: 2 of 5
7. (collect carrier1 parcel4 bay1 lefthand1)
   deleted: (posted parcel4 bay1) (vacant carrier1 lefthand1)
   added: (bearing carrier1 parcel4 lefthand1)
   goals met: 2 of 5
8. (deposit carrier1 parcel5 bay1 righthand1)
   deleted: (bearing carrier1 parcel5 righthand1)
   added: (posted parcel5 bay1) (vacant carrier1 righthand1)
   goals met: 3 of 5
9. (walk carrier1 bay1 bay2)
   deleted: (stationed-at carrier1 bay1)
   added: (stationed-at carrier1 bay2)
   goals met: 3 of 5
10. (deposit carrier1 parcel4 bay2 lefthand1)
   deleted: (bearing carrier1 parcel4 lefthand1)
   added: (posted parcel4 bay2) (vacant carrier1 lefthand1)
   goals met: 4 of 5
11. (walk carrier3 bay2 bay4)
   deleted: (stationed-at carrier3 bay2)
   added: (stationed-at carrier3 bay4)
   goals met: 4 of 5
12. (collect carrier3 parcel2 bay4 lefthand3)
   deleted: (posted parcel2 bay4) (vacant carrier3 lefthand3)
   added: (bearing carrier3 parcel2 lefthand3)
   goals met: 4 of 5
13. (walk carrier3 bay4 bay2)
   deleted: (stationed-at carrier3 bay4)
   added: (stationed-at carrier3 bay2)
   goals met: 4 of 5
14. (deposit carrier3 parcel2 bay2 lefthand3)
   deleted: (bearing carrier3 parcel2 lefthand3)
   added: (posted parcel2 bay2) (vacant carrier3 lefthand3)
   goals met: 5 of 5
